---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionsMeasurementOptions
source: html/28aea025-2622-dc0f-ae41-cca246cbeac1.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionsMeasurementOptions Property

Identifies the measurement option for angular dimensions.

## Syntax (C#)
```csharp
public BendingDetailAngularDimensionsMeasurementOptions AngularDimensionsMeasurementOptions { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration